Tekla.Structures.Model.UI.Color
The Color class represents an RGB color with transparency. The color values must be between 0.0 and 1.0.
using Tekla.Structures.Model.UI;
public class Example
{
public void Example1()
{
Color SolidGreen = new Color(0.0, 1.0, 0.0);
Color SeeThroughBlue = new Color(0.0, 0.0, 1.0, 0.5);
}
}

Tekla.Structures.Model.UI.Color.Red
The red value of the color, between 0.0 and 1.0.

Tekla.Structures.Model.UI.Color.Green
The green value of the color, between 0.0 and 1.0.

Tekla.Structures.Model.UI.Color.Blue
The blue value of the color, between 0.0 and 1.0.

Tekla.Structures.Model.UI.Color.Transparency
The transparency value of the color, between 0.0 (completely see-through) and 1.0 (completely solid).

Tekla.Structures.Model.UI.Color.#ctor
Creates a new color object. The default object is black.

Tekla.Structures.Model.UI.Color.#ctor(System.Double,System.Double,System.Double)
Creates a new color object with the given values.
Red: The red value of the color, between 0.0 and 1.0.
Green: The green value of the color, between 0.0 and 1.0.
Blue: The blue value of the color, between 0.0 and 1.0.

Tekla.Structures.Model.UI.Color.#ctor(System.Double,System.Double,System.Double,System.Double)
Creates a new color object with the given values.
Red: The red value of the color, between 0.0 and 1.0.
Green: The green value of the color, between 0.0 and 1.0.
Blue: The blue value of the color, between 0.0 and 1.0.
Transparency: The transparency value of the color,
between 0.0 (completely see-through) and 1.0 (completely solid).

Tekla.Structures.Model.UI.Color.ToStruct(Tekla.Structures.ModelInternal.dotColor_t@)


Tekla.Structures.Model.UI.Color.FromStruct(Tekla.Structures.ModelInternal.dotColor_t@)
